pei2333/STM32F4-SLAM-zjut/lvgl_mlx90640-main/BaseDrive/adxl345.c
#include "adxl345.h"
#include "delay.h"
#include <math.h>
#include <stddef.h>

// 强制定义 STM32F4XX 宏
#ifndef STM32F4XX
#define STM32F4XX
#endif

// STM32 库文件包含 - 使用条件编译确保兼容性
#if defined(STM32F4XX)
    #include "stm32f4xx.h"
    #include "stm32f4xx_i2c.h"
    #include "stm32f4xx_rcc.h"
    #include "stm32f4xx_gpio.h"
    #include "misc.h"
    
    #define I2C_PORT            I2C1
    #define I2C_CLOCK           RCC_APB1Periph_I2C1
    #define GPIO_CLOCK          RCC_AHB1Periph_GPIOB
    #define SCL_PIN             GPIO_Pin_6
    #define SDA_PIN             GPIO_Pin_7
    #define SCL_PIN_SOURCE      GPIO_PinSource6
    #define SDA_PIN_SOURCE      GPIO_PinSource7
    #define GPIO_PORT           GPIOB
    #define I2C_AF              GPIO_AF_I2C1
#else
    // 如果没有STM32库，定义基本类型和函数
    typedef struct { int dummy; } GPIO_InitTypeDef;
    typedef struct { int dummy; } I2C_InitTypeDef;
    typedef struct { int dummy; } NVIC_InitTypeDef;
    
    #define ENABLE  1
    #define DISABLE 0
    #define SET     1
    #define RESET   0
    
    // 定义空函数防止编译错误
    static void RCC_APB1PeriphClockCmd(uint32_t periph, int state) { (void)periph; (void)state; }
    static void RCC_AHB1PeriphClockCmd(uint32_t periph, int state) { (void)periph; (void)state; }
    static void GPIO_Init(void* port, GPIO_InitTypeDef* init) { (void)port; (void)init; }
    static void GPIO_PinAFConfig(void* port, uint8_t pin, uint8_t af) { (void)port; (void)pin; (void)af; }
    static void I2C_DeInit(void* i2c) { (void)i2c; }
    static void I2C_Init(void* i2c, I2C_InitTypeDef* init) { (void)i2c; (void)init; }
    static void I2C_Cmd(void* i2c, int state) { (void)i2c; (void)state; }
    static void NVIC_Init(NVIC_InitTypeDef* init) { (void)init; }
    static int I2C_GetFlagStatus(void* i2c, uint32_t flag) { (void)i2c; (void)flag; return 0; }
    static void I2C_GenerateSTART(void* i2c, int state) { (void)i2c; (void)state; }
    static void I2C_Send7bitAddress(void* i2c, uint8_t addr, uint8_t dir) { (void)i2c; (void)addr; (void)dir; }
    static void I2C_SendData(void* i2c, uint8_t data) { (void)i2c; (void)data; }
    static void I2C_GenerateSTOP(void* i2c, int state) { (void)i2c; (void)state; }
    static void I2C_AcknowledgeConfig(void* i2c, int state) { (void)i2c; (void)state; }
    static uint8_t I2C_ReceiveData(void* i2c) { (void)i2c; return 0; }
    
    #define I2C_PORT            ((void*)0)
    #define I2C_CLOCK           0
    #define GPIO_CLOCK          0
    #define SCL_PIN             0
    #define SDA_PIN             0
    #define SCL_PIN_SOURCE      0
    #define SDA_PIN_SOURCE      0
    #define GPIO_PORT           ((void*)0)
    #define I2C_AF              0
    #define I2C_FLAG_BUSY       0
    #define I2C_FLAG_SB         0
    #define I2C_FLAG_ADDR       0
    #define I2C_FLAG_BTF        0
    #define I2C_FLAG_RXNE       0
    #define I2C_Direction_Transmitter  0
    #define I2C_Direction_Receiver     0
    #define I2C1_EV_IRQn        0
#endif

// ADXL345 寄存器地址定义
#define ADXL345_ADDR            0x53    // ADXL345 器件地址
#define ADXL345_DEVID           0x00    // 器件ID
#define ADXL345_POWER_CTL       0x2D    // 电源控制寄存器
#define ADXL345_DATA_FORMAT     0x31    // 数据格式寄存器
#define ADXL345_DATAX0          0x32    // X轴数据0
#define ADXL345_DATAX1          0x33    // X轴数据1
#define ADXL345_DATAY0          0x34    // Y轴数据0
#define ADXL345_DATAY1          0x35    // Y轴数据1
#define ADXL345_DATAZ0          0x36    // Z轴数据0
#define ADXL345_DATAZ1          0x37    // Z轴数据1

// 滤波参数
#define FS          200.0f    // 采样频率 200Hz
#define FC_LP       5.0f      // 低通截止频率 5Hz
#define FC_HP       0.1f      // 高通截止频率 0.1Hz
#define MA_SIZE     4         // 滑动平均窗口大小
#define PI          3.14159265358979323846f

// 滤波状态变量
static float alpha_lp;        // 低通滤波系数
static float alpha_hp;        // 高通滤波系数
static float y_lp_x_prev = 0, y_lp_y_prev = 0, y_lp_z_prev = 0;  // 低通滤波状态
static float x_hp_prev_x = 0, y_hp_prev_x = 0;  // X轴高通滤波状态
static float x_hp_prev_y = 0, y_hp_prev_y = 0;  // Y轴高通滤波状态
static float x_hp_prev_z = 0, y_hp_prev_z = 0;  // Z轴高通滤波状态
static float buffer_x[MA_SIZE] = {0};  // X轴滑动平均缓冲区
static float buffer_y[MA_SIZE] = {0};  // Y轴滑动平均缓冲区
static float buffer_z[MA_SIZE] = {0};  // Z轴滑动平均缓冲区
static int ma_index = 0;      // 滑动平均缓冲区索引

// 校准偏置
static float bias_x_g = 0, bias_y_g = 0, bias_z_g = 0;

// 全局变量
ADXL345_DATA adxl345_data;

// 滤波器参数
#define TIMEOUT_COUNT       10000   // I2C超时计数

// 静态变量
static bool g_adxl345_initialized = false;
static ADXL345_InterruptCallback g_interrupt_callback = NULL;

// 滤波器状态变量
static float alpha_lp = 0, alpha_hp = 0;
static float y_lp_prev[3] = {0};      // 低通滤波状态 [x,y,z]
static float x_hp_prev[3] = {0};      // 高通滤波输入状态 [x,y,z]
static float y_hp_prev[3] = {0};      // 高通滤波输出状态 [x,y,z]
static float ma_buffer[3][ADXL345_MA_SIZE] = {0}; // 滑动平均缓冲区
static uint8_t ma_buffer_index = 0;   // 改名避免重复定义

// 全局变量定义
ADXL345_DATA adxl345_data = {0};
ADXL345_STATUS adxl345_status = {0};
ADXL345_CALIBRATION adxl345_calibration = {0};

// 私有函数声明
static int8_t I2C_Configuration(void);
static int8_t ADXL345_WriteByte(uint8_t reg, uint8_t data);
static int8_t ADXL345_ReadByte(uint8_t reg, uint8_t *data);
static int8_t ADXL345_ReadMultiBytes(uint8_t reg, uint8_t *buffer, uint8_t length);
static void Filter_Init(void);
static void Lowpass_Filter(float input[3], float output[3]);
static void Highpass_Filter(float input[3], float output[3]);
static void MovingAverage_Filter(float input[3], float output[3]);
static int8_t ADXL345_WaitForFlag(uint32_t flag, bool state);
static void ADXL345_UpdateStatus(void);
static uint32_t GetSystemTick(void);

/**
 * @brief 获取系统时钟节拍（毫秒）
 */
static uint32_t GetSystemTick(void)
{
    // 这里应该调用系统的毫秒计时函数
    // 例如 HAL_GetTick() 或自定义的毫秒计数器
    static uint32_t tick_count = 0;
    return tick_count++;  // 简单的计数器，实际应用中需要使用真实的时钟
}

/**
 * @brief 等待I2C标志位
 */
static int8_t ADXL345_WaitForFlag(uint32_t flag, bool state)
{
    uint32_t timeout = TIMEOUT_COUNT;
    
    while(timeout--) {
        bool current_state = (I2C_GetFlagStatus(I2C_PORT, flag) == SET);
        if(current_state == state) {
            return ADXL345_SUCCESS;
        }
    }
    
    adxl345_status.comm_errors++;
    return ADXL345_TIMEOUT;
}

/**
 * @brief 初始化I2C接口
 */
static int8_t I2C_Configuration(void)
{
#if defined(STM32F4XX) && !defined(DISABLE_STM32_FEATURES)
    GPIO_InitTypeDef GPIO_InitStructure;
    I2C_InitTypeDef I2C_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

    // 使能时钟
    RCC_APB1PeriphClockCmd(I2C_CLOCK, ENABLE);
    RCC_AHB1PeriphClockCmd(GPIO_CLOCK, ENABLE);

