pei2333/STM32F4-SLAM-zjut/lvgl_mlx90640-main/BaseDrive/adxl345.c
    // 配置I2C引脚
    GPIO_InitStructure.GPIO_Pin = SCL_PIN | SDA_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_Init(GPIO_PORT, &GPIO_InitStructure);

    // 配置引脚复用
    GPIO_PinAFConfig(GPIO_PORT, SCL_PIN_SOURCE, I2C_AF);
    GPIO_PinAFConfig(GPIO_PORT, SDA_PIN_SOURCE, I2C_AF);

    // 复位I2C
    I2C_DeInit(I2C_PORT);

    // 配置I2C
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = 0x00;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed = 400000;  // 400kHz
    I2C_Init(I2C_PORT, &I2C_InitStructure);

    // 配置中断（可选）
    NVIC_InitStructure.NVIC_IRQChannel = I2C1_EV_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    // 使能I2C
    I2C_Cmd(I2C_PORT, ENABLE);
#endif

    return ADXL345_SUCCESS;
}

/**
 * @brief 写入单个字节到ADXL345
 */
static int8_t ADXL345_WriteByte(uint8_t reg, uint8_t data)
{
    // 等待总线空闲
    if(ADXL345_WaitForFlag(I2C_FLAG_BUSY, false) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 发送起始条件
    I2C_GenerateSTART(I2C_PORT, ENABLE);
    if(ADXL345_WaitForFlag(I2C_FLAG_SB, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 发送设备地址（写）
    I2C_Send7bitAddress(I2C_PORT, ADXL345_ADDR << 1, I2C_Direction_Transmitter);
    if(ADXL345_WaitForFlag(I2C_FLAG_ADDR, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 清除ADDR标志
    I2C_PORT->SR2;
    
    // 发送寄存器地址
    I2C_SendData(I2C_PORT, reg);
    if(ADXL345_WaitForFlag(I2C_FLAG_BTF, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 发送数据
    I2C_SendData(I2C_PORT, data);
    if(ADXL345_WaitForFlag(I2C_FLAG_BTF, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 发送停止条件
    I2C_GenerateSTOP(I2C_PORT, ENABLE);
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 从ADXL345读取单个字节
 */
static int8_t ADXL345_ReadByte(uint8_t reg, uint8_t *data)
{
    if(data == NULL) return ADXL345_INVALID;
    
    // 等待总线空闲
    if(ADXL345_WaitForFlag(I2C_FLAG_BUSY, false) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 发送起始条件
    I2C_GenerateSTART(I2C_PORT, ENABLE);
    if(ADXL345_WaitForFlag(I2C_FLAG_SB, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 发送设备地址（写）
    I2C_Send7bitAddress(I2C_PORT, ADXL345_ADDR << 1, I2C_Direction_Transmitter);
    if(ADXL345_WaitForFlag(I2C_FLAG_ADDR, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 清除ADDR标志
    I2C_PORT->SR2;
    
    // 发送寄存器地址
    I2C_SendData(I2C_PORT, reg);
    if(ADXL345_WaitForFlag(I2C_FLAG_BTF, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 重新发送起始条件
    I2C_GenerateSTART(I2C_PORT, ENABLE);
    if(ADXL345_WaitForFlag(I2C_FLAG_SB, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 发送设备地址（读）
    I2C_Send7bitAddress(I2C_PORT, ADXL345_ADDR << 1, I2C_Direction_Receiver);
    if(ADXL345_WaitForFlag(I2C_FLAG_ADDR, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 禁用ACK
    I2C_AcknowledgeConfig(I2C_PORT, DISABLE);
    
    // 清除ADDR标志
    I2C_PORT->SR2;
    
    // 发送停止条件
    I2C_GenerateSTOP(I2C_PORT, ENABLE);
    
    // 等待数据接收
    if(ADXL345_WaitForFlag(I2C_FLAG_RXNE, true) != ADXL345_SUCCESS) {
        I2C_AcknowledgeConfig(I2C_PORT, ENABLE);
        return ADXL345_TIMEOUT;
    }
    
    // 读取数据
    *data = I2C_ReceiveData(I2C_PORT);
    
    // 重新使能ACK
    I2C_AcknowledgeConfig(I2C_PORT, ENABLE);
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 从ADXL345读取多个字节
 */
static int8_t ADXL345_ReadMultiBytes(uint8_t reg, uint8_t *buffer, uint8_t length)
{
    if(buffer == NULL || length == 0) return ADXL345_INVALID;
    
    // 等待总线空闲
    if(ADXL345_WaitForFlag(I2C_FLAG_BUSY, false) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 发送起始条件
    I2C_GenerateSTART(I2C_PORT, ENABLE);
    if(ADXL345_WaitForFlag(I2C_FLAG_SB, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 发送设备地址（写）
    I2C_Send7bitAddress(I2C_PORT, ADXL345_ADDR << 1, I2C_Direction_Transmitter);
    if(ADXL345_WaitForFlag(I2C_FLAG_ADDR, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 清除ADDR标志
    I2C_PORT->SR2;
    
    // 发送寄存器地址
    I2C_SendData(I2C_PORT, reg);
    if(ADXL345_WaitForFlag(I2C_FLAG_BTF, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 重新发送起始条件
    I2C_GenerateSTART(I2C_PORT, ENABLE);
    if(ADXL345_WaitForFlag(I2C_FLAG_SB, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 发送设备地址（读）
    I2C_Send7bitAddress(I2C_PORT, ADXL345_ADDR << 1, I2C_Direction_Receiver);
    if(ADXL345_WaitForFlag(I2C_FLAG_ADDR, true) != ADXL345_SUCCESS) {
        return ADXL345_TIMEOUT;
    }
    
    // 清除ADDR标志
    I2C_PORT->SR2;
    
    // 读取数据
    for(uint8_t i = 0; i < length; i++) {
        if(i == length - 1) {
            // 最后一个字节，禁用ACK
            I2C_AcknowledgeConfig(I2C_PORT, DISABLE);
            I2C_GenerateSTOP(I2C_PORT, ENABLE);
        }
        
        // 等待数据接收
        if(ADXL345_WaitForFlag(I2C_FLAG_RXNE, true) != ADXL345_SUCCESS) {
            I2C_AcknowledgeConfig(I2C_PORT, ENABLE);
            return ADXL345_TIMEOUT;
        }
        
        buffer[i] = I2C_ReceiveData(I2C_PORT);
    }
    
    // 重新使能ACK
    I2C_AcknowledgeConfig(I2C_PORT, ENABLE);
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 初始化滤波器参数
 */
static void Filter_Init(void)
{
    float dt = 1.0f / FS;
    
    // 计算低通滤波系数
    float rc_lp = 1.0f / (2.0f * PI * FC_LP);
    alpha_lp = expf(-dt / rc_lp);
    
    // 计算高通滤波系数
    float rc_hp = 1.0f / (2.0f * PI * FC_HP);
    alpha_hp = rc_hp / (rc_hp + dt);
    
    // 清零滤波器状态
    for(int i = 0; i < 3; i++) {
        y_lp_prev[i] = 0;
        x_hp_prev[i] = 0;
        y_hp_prev[i] = 0;
        for(int j = 0; j < MA_SIZE; j++) {
            buffer_x[j] = 0;
            buffer_y[j] = 0;
            buffer_z[j] = 0;
        }
    }
    ma_index = 0;
}

/**
 * @brief 低通滤波器
 */
static void Lowpass_Filter(float input[3], float output[3])
{
    for(int i = 0; i < 3; i++) {
        output[i] = alpha_lp * input[i] + (1.0f - alpha_lp) * y_lp_prev[i];
        y_lp_prev[i] = output[i];
    }
}

/**
 * @brief 高通滤波器
 */
static void Highpass_Filter(float input[3], float output[3])
{
    for(int i = 0; i < 3; i++) {
        float x_diff = input[i] - x_hp_prev[i];
        output[i] = alpha_hp * (y_hp_prev[i] + x_diff);
        x_hp_prev[i] = input[i];
        y_hp_prev[i] = output[i];
    }
}

/**
 * @brief 滑动平均滤波器
 */
static void MovingAverage_Filter(float input[3], float output[3])
{
    // 更新缓冲区
    for(int i = 0; i < 3; i++) {
        buffer_x[ma_index] = input[i];
    }
    ma_index = (ma_index + 1) % MA_SIZE;
    
