pei2333/STM32F4-SLAM-zjut/lvgl_mlx90640-main/BaseDrive/adxl345.c
    // 计算平均值
    for(int i = 0; i < 3; i++) {
        float sum = 0;
        for(int j = 0; j < MA_SIZE; j++) {
            sum += buffer_x[j];
        }
        output[i] = sum / MA_SIZE;
    }
}

/**
 * @brief 更新ADXL345状态
 */
static void ADXL345_UpdateStatus(void)
{
    adxl345_status.last_update = GetSystemTick();
    adxl345_status.data_ready = true;
}

/**
 * @brief 初始化ADXL345
 */
int8_t ADXL345_Init(void)
{
    uint8_t device_id;
    int8_t result;
    
    // 初始化状态
    adxl345_status.initialized = false;
    adxl345_status.comm_errors = 0;
    adxl345_status.data_ready = false;
    adxl345_status.range = ADXL345_RANGE_16G;
    adxl345_status.self_test_passed = false;
    
    // 初始化I2C接口
    result = I2C_Configuration();
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 短暂延时等待器件启动
    delay_ms(10);
    
    // 检查设备ID
    result = ADXL345_ReadByte(ADXL345_DEVID, &device_id);
    if(result != ADXL345_SUCCESS) {
        return ADXL345_COMM_ERROR;
    }
    
    if(device_id != ADXL345_DEVICE_ID) {
        return ADXL345_NOT_FOUND;
    }
    
    // 软复位 - 写入电源控制寄存器
    result = ADXL345_WriteByte(ADXL345_POWER_CTL, 0x00);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    delay_ms(5);
    
    // 配置数据格式：全分辨率模式，±16g量程
    result = ADXL345_WriteByte(ADXL345_DATA_FORMAT, 
                              ADXL345_FULL_RES | ADXL345_RANGE_16G);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 设置数据速率：200Hz
    result = ADXL345_WriteByte(ADXL345_BW_RATE, 0x0C);  // 200Hz
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 启用测量模式
    result = ADXL345_WriteByte(ADXL345_POWER_CTL, ADXL345_PCTL_MEASURE);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 初始化滤波器
    Filter_Init();
    
    // 执行校准
    result = ADXL345_Calibrate();
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 执行自检
    result = ADXL345_SelfTest();
    if(result != ADXL345_SUCCESS) {
        adxl345_status.self_test_passed = false;
        // 自检失败不阻止初始化，仅记录状态
    } else {
        adxl345_status.self_test_passed = true;
    }
    
    // 标记初始化完成
    adxl345_status.initialized = true;
    g_adxl345_initialized = true;
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 反初始化ADXL345
 */
int8_t ADXL345_Deinit(void)
{
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    // 进入待机模式
    ADXL345_WriteByte(ADXL345_POWER_CTL, ADXL345_PCTL_WAKEUP);
    
    // 禁用所有中断
    ADXL345_WriteByte(ADXL345_INT_ENABLE, 0x00);
    
    // 复位I2C
    I2C_DeInit(I2C_PORT);
    
    // 清除状态
    adxl345_status.initialized = false;
    g_adxl345_initialized = false;
    g_interrupt_callback = NULL;
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 软复位ADXL345
 */
int8_t ADXL345_Reset(void)
{
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    // 先反初始化再重新初始化
    ADXL345_Deinit();
    delay_ms(10);
    return ADXL345_Init();
}

/**
 * @brief 读取原始数据
 */
int8_t ADXL345_ReadRawData(int16_t *x, int16_t *y, int16_t *z)
{
    uint8_t buffer[6];
    int8_t result;
    
    if(!g_adxl345_initialized || x == NULL || y == NULL || z == NULL) {
        return ADXL345_ERROR;
    }
    
    // 读取6字节原始数据
    result = ADXL345_ReadMultiBytes(ADXL345_DATAX0, buffer, 6);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 转换为16位有符号数
    *x = (int16_t)((buffer[1] << 8) | buffer[0]);
    *y = (int16_t)((buffer[3] << 8) | buffer[2]);
    *z = (int16_t)((buffer[5] << 8) | buffer[4]);
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 读取并处理ADXL345数据
 */
int8_t ADXL345_ReadData(void)
{
    int16_t raw_x, raw_y, raw_z;
    float acc_raw[3], acc_lp[3], acc_hp[3], acc_final[3];
    int8_t result;
    
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    // 读取原始数据
    result = ADXL345_ReadRawData(&raw_x, &raw_y, &raw_z);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 转换为g单位（16g量程，13位分辨率）
    const float scale = 0.004f;  // 4mg/LSB
    acc_raw[0] = raw_x * scale - adxl345_calibration.x_bias;
    acc_raw[1] = raw_y * scale - adxl345_calibration.y_bias;
    acc_raw[2] = raw_z * scale - adxl345_calibration.z_bias;
    
    // 应用滤波器链
    Lowpass_Filter(acc_raw, acc_lp);
    Highpass_Filter(acc_lp, acc_hp);
    MovingAverage_Filter(acc_hp, acc_final);
    
    // 更新全局数据
    adxl345_data.x = acc_final[0];
    adxl345_data.y = acc_final[1];
    adxl345_data.z = acc_final[2];
    adxl345_data.timestamp = GetSystemTick();
    
    // 更新状态
    ADXL345_UpdateStatus();
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 校准ADXL345
 */
int8_t ADXL345_Calibrate(void)
{
    const uint16_t sample_count = ADXL345_CALIB_SAMPLES;
    float sum_x = 0, sum_y = 0, sum_z = 0;
    int16_t raw_x, raw_y, raw_z;
    int8_t result;
    
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    // 清除当前偏置
    adxl345_calibration.x_bias = 0;
    adxl345_calibration.y_bias = 0;
    adxl345_calibration.z_bias = 0;
    
    // 收集校准样本
    for(uint16_t i = 0; i < sample_count; i++) {
        result = ADXL345_ReadRawData(&raw_x, &raw_y, &raw_z);
        if(result != ADXL345_SUCCESS) {
            return result;
        }
        
        // 累加原始值
        const float scale = 0.004f;
        sum_x += raw_x * scale;
        sum_y += raw_y * scale;
        sum_z += raw_z * scale;
        
        delay_ms(5);  // 5ms间隔
    }
    
    // 计算平均值作为偏置
    adxl345_calibration.x_bias = sum_x / sample_count;
    adxl345_calibration.y_bias = sum_y / sample_count;
    adxl345_calibration.z_bias = sum_z / sample_count - 1.0f;  // Z轴减去1g重力
    
    adxl345_calibration.calibrated = true;
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 自检功能
 */
int8_t ADXL345_SelfTest(void)
{
    uint8_t original_format;
    int16_t normal_x, normal_y, normal_z;
    int16_t selftest_x, selftest_y, selftest_z;
    int8_t result;
    
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
