pei2333/STM32F4-SLAM-zjut/lvgl_mlx90640-main/BaseDrive/adxl345.c
    // 读取当前数据格式设置
    result = ADXL345_ReadByte(ADXL345_DATA_FORMAT, &original_format);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 读取正常模式下的数据
    result = ADXL345_ReadRawData(&normal_x, &normal_y, &normal_z);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 启用自检模式
    result = ADXL345_WriteByte(ADXL345_DATA_FORMAT, original_format | 0x80);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    delay_ms(10);  // 等待稳定
    
    // 读取自检模式下的数据
    result = ADXL345_ReadRawData(&selftest_x, &selftest_y, &selftest_z);
    if(result != ADXL345_SUCCESS) {
        // 恢复原始设置
        ADXL345_WriteByte(ADXL345_DATA_FORMAT, original_format);
        return result;
    }
    
    // 恢复原始设置
    result = ADXL345_WriteByte(ADXL345_DATA_FORMAT, original_format);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 计算自检变化量（应该在50-540 LSB范围内）
    int16_t diff_x = abs(selftest_x - normal_x);
    int16_t diff_y = abs(selftest_y - normal_y);
    int16_t diff_z = abs(selftest_z - normal_z);
    
    // 检查自检结果
    if(diff_x >= 50 && diff_x <= 540 &&
       diff_y >= 50 && diff_y <= 540 &&
       diff_z >= 75 && diff_z <= 875) {  // Z轴阈值略有不同
        return ADXL345_SUCCESS;
    }
    
    return ADXL345_ERROR;
}

/**
 * @brief 设置量程
 */
int8_t ADXL345_SetRange(uint8_t range)
{
    uint8_t data_format;
    int8_t result;
    
    if(!g_adxl345_initialized || range > ADXL345_RANGE_16G) {
        return ADXL345_ERROR;
    }
    
    // 读取当前数据格式
    result = ADXL345_ReadByte(ADXL345_DATA_FORMAT, &data_format);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 更新量程设置
    data_format = (data_format & 0xFC) | range;
    result = ADXL345_WriteByte(ADXL345_DATA_FORMAT, data_format);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    adxl345_status.range = range;
    return ADXL345_SUCCESS;
}

/**
 * @brief 设置数据速率
 */
int8_t ADXL345_SetDataRate(uint8_t rate)
{
    if(!g_adxl345_initialized || rate > 0x0F) {
        return ADXL345_ERROR;
    }
    
    return ADXL345_WriteByte(ADXL345_BW_RATE, rate);
}

/**
 * @brief 设置电源模式
 */
int8_t ADXL345_SetPowerMode(uint8_t mode)
{
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    return ADXL345_WriteByte(ADXL345_POWER_CTL, mode);
}

/**
 * @brief 进入睡眠模式
 */
int8_t ADXL345_Sleep(void)
{
    return ADXL345_SetPowerMode(ADXL345_PCTL_SLEEP);
}

/**
 * @brief 唤醒设备
 */
int8_t ADXL345_Wakeup(void)
{
    return ADXL345_SetPowerMode(ADXL345_PCTL_MEASURE);
}

/**
 * @brief 设置偏移量
 */
int8_t ADXL345_SetOffset(float x_offset, float y_offset, float z_offset)
{
    int8_t result;
    
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    // 将g转换为偏移寄存器值（15.6mg/LSB）
    int8_t x_off = (int8_t)(x_offset / 0.0156f);
    int8_t y_off = (int8_t)(y_offset / 0.0156f);
    int8_t z_off = (int8_t)(z_offset / 0.0156f);
    
    result = ADXL345_WriteByte(ADXL345_OFSX, x_off);
    if(result != ADXL345_SUCCESS) return result;
    
    result = ADXL345_WriteByte(ADXL345_OFSY, y_off);
    if(result != ADXL345_SUCCESS) return result;
    
    result = ADXL345_WriteByte(ADXL345_OFSZ, z_off);
    if(result != ADXL345_SUCCESS) return result;
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 使能/禁用中断
 */
int8_t ADXL345_EnableInterrupt(uint8_t int_type, bool enable)
{
    uint8_t int_enable;
    int8_t result;
    
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    // 读取当前中断使能状态
    result = ADXL345_ReadByte(ADXL345_INT_ENABLE, &int_enable);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 更新中断使能
    if(enable) {
        int_enable |= int_type;
    } else {
        int_enable &= ~int_type;
    }
    
    return ADXL345_WriteByte(ADXL345_INT_ENABLE, int_enable);
}

/**
 * @brief 映射中断到引脚
 */
int8_t ADXL345_MapInterrupt(uint8_t int_type, uint8_t pin)
{
    uint8_t int_map;
    int8_t result;
    
    if(!g_adxl345_initialized || pin > 1) {
        return ADXL345_ERROR;
    }
    
    // 读取当前中断映射
    result = ADXL345_ReadByte(ADXL345_INT_MAP, &int_map);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 更新中断映射（0=INT1, 1=INT2）
    if(pin == 0) {
        int_map &= ~int_type;  // 映射到INT1
    } else {
        int_map |= int_type;   // 映射到INT2
    }
    
    return ADXL345_WriteByte(ADXL345_INT_MAP, int_map);
}

/**
 * @brief 获取中断源
 */
uint8_t ADXL345_GetInterruptSource(void)
{
    uint8_t int_source = 0;
    
    if(g_adxl345_initialized) {
        ADXL345_ReadByte(ADXL345_INT_SOURCE, &int_source);
    }
    
    return int_source;
}

/**
 * @brief 检查数据是否就绪
 */
bool ADXL345_IsDataReady(void)
{
    uint8_t int_source = ADXL345_GetInterruptSource();
    return (int_source & ADXL345_INT_DATA_READY) ? true : false;
}

/**
 * @brief 获取状态
 */
ADXL345_STATUS ADXL345_GetStatus(void)
{
    return adxl345_status;
}

/**
 * @brief 获取校准信息
 */
ADXL345_CALIBRATION ADXL345_GetCalibration(void)
{
    return adxl345_calibration;
}

/**
 * @brief 设置中断回调函数
 */
void ADXL345_SetInterruptCallback(ADXL345_InterruptCallback callback)
{
    g_interrupt_callback = callback;
}

/**
 * @brief 中断处理函数
 */
void ADXL345_IRQHandler(void)
{
    if(!g_adxl345_initialized) {
        return;
    }
    
    uint8_t int_source = ADXL345_GetInterruptSource();
    
    if(int_source & ADXL345_INT_DATA_READY) {
        // 数据就绪中断 - 自动读取数据
        ADXL345_ReadData();
    }
    
    // 调用用户回调函数
    if(g_interrupt_callback != NULL) {
        g_interrupt_callback(int_source);
    }
}

/**
 * @brief 配置敲击检测
 */
int8_t ADXL345_ConfigTapDetection(uint8_t threshold, uint8_t duration)
{
    int8_t result;
    
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    // 设置敲击阈值
    result = ADXL345_WriteByte(ADXL345_THRESH_TAP, threshold);
    if(result != ADXL345_SUCCESS) return result;
    
    // 设置敲击持续时间
    result = ADXL345_WriteByte(ADXL345_DUR, duration);
    if(result != ADXL345_SUCCESS) return result;
    
    // 使能XYZ轴敲击检测
    result = ADXL345_WriteByte(ADXL345_TAP_AXES, 0x07);
    if(result != ADXL345_SUCCESS) return result;
    
