pei2333/STM32F4-SLAM-zjut/lvgl_mlx90640-main/BaseDrive/adxl345.c
    return ADXL345_SUCCESS;
}

/**
 * @brief 配置活动检测
 */
int8_t ADXL345_ConfigActivityDetection(uint8_t threshold, uint8_t time)
{
    int8_t result;
    
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    // 设置活动阈值
    result = ADXL345_WriteByte(ADXL345_THRESH_ACT, threshold);
    if(result != ADXL345_SUCCESS) return result;
    
    // 设置静止阈值
    result = ADXL345_WriteByte(ADXL345_THRESH_INACT, threshold / 2);
    if(result != ADXL345_SUCCESS) return result;
    
    // 设置静止时间
    result = ADXL345_WriteByte(ADXL345_TIME_INACT, time);
    if(result != ADXL345_SUCCESS) return result;
    
    // 配置活动/静止控制
    result = ADXL345_WriteByte(ADXL345_ACT_INACT_CTL, 0xFF);
    if(result != ADXL345_SUCCESS) return result;
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 配置自由落体检测
 */
int8_t ADXL345_ConfigFreeFallDetection(uint8_t threshold, uint8_t time)
{
    int8_t result;
    
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    // 设置自由落体阈值
    result = ADXL345_WriteByte(ADXL345_THRESH_FF, threshold);
    if(result != ADXL345_SUCCESS) return result;
    
    // 设置自由落体时间
    result = ADXL345_WriteByte(ADXL345_TIME_FF, time);
    if(result != ADXL345_SUCCESS) return result;
    
    return ADXL345_SUCCESS;
}

/**
 * @brief 设置低功耗模式
 */
int8_t ADXL345_SetLowPowerMode(bool enable)
{
    uint8_t power_ctl;
    int8_t result;
    
    if(!g_adxl345_initialized) {
        return ADXL345_ERROR;
    }
    
    // 读取当前电源控制状态
    result = ADXL345_ReadByte(ADXL345_POWER_CTL, &power_ctl);
    if(result != ADXL345_SUCCESS) {
        return result;
    }
    
    // 更新低功耗位
    if(enable) {
        power_ctl |= 0x10;  // 设置低功耗位
    } else {
        power_ctl &= ~0x10; // 清除低功耗位
    }
    
    return ADXL345_WriteByte(ADXL345_POWER_CTL, power_ctl);
}

